Modul3/perpustakaan/src/main/resources/request/getBooks.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://www.polstat.com/perpustakaan/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:getBooksRequest/>
    </soapenv:Body>
</soapenv:Envelope>